tests/web/taurus/web_performance.yaml
execution:
- executor: selenium
  scenario: google_search_scenario
  options:
    browser: chrome
    additional-args:
    - "--user-data-dir=/tmp/chrome-profile-${__time()}-${__threadNum}"

scenarios:
  google_search_scenario:
    script: ../../tests/web/selenium/web_performance_test.py
    iterations: 5
    concurrency: 3
    hold-for: 1m

reporting:
- module: console
- module: final-stats
- module: junit-xml
  outfile: ../../results/performance_results/baseline/web/web_test_result.xml

# - module: html
#   output: ../../results/performance_results/baseline/web/web_report.html